[
    {
        "key": "kabbalat-shabbat",
        "sections": [
            {
                "name": "לכו נרננה",
                "ref": "מזמור צ\"ה",
                "text": "לְכוּ נְרַנְּנָה לַה' נָרִיעָה לְצוּר יִשְׁעֵנוּ: נְקַדְּמָה פָנָיו בְּתוֹדָה בִּזְמִרוֹת נָרִיעַ לוֹ: כִּי אֵל גָּדוֹל ה' וּמֶלֶךְ גָּדוֹל עַל כָּל אֱלֹהִים: אֲשֶׁר בְּיָדוֹ מֶחְקְרֵי אָרֶץ וְתוֹעֲפוֹת הָרִים לוֹ: אֲשֶׁר לוֹ הַיָּם וְהוּא עָשָׂהוּ וְיַבֶּשֶׁת יָדָיו יָצָרוּ: בֹּאוֹ נִשְׁתַּחֲוֶה וְנִכְרָעָה נִבְרְכָה לִפְנֵי ה' עֹשֵׂנוּ: כִּי הוּא אֱלֹהֵינוּ וַאֲנַחְנוּ עַם מַרְעִיתוֹ וְצֹאן יָדוֹ הַיּוֹם אִם בְּקֹלוֹ תִשְׁמָעוּ: אַל תַּקְשׁוּ לְבַבְכֶם כִּמְרִיבָה כְּיוֹם מַסָּה בַּמִּדְבָּר: אֲשֶׁר נִסּוּנִי אֲבוֹתֵיכֶם בְּחָנוּנִי גַּם רָאוּ פָעֳלִי: אַרְבָּעִים שָׁנָה אָקוּט בְּדוֹר וָאֹמַר עַם תֹּעֵי לֵבָב הֵם וְהֵם לֹא יָדְעוּ דְרָכָי: אֲשֶׁר נִשְׁבַּעְתִּי בְאַפִּי אִם יְבֹאוֹן אֶל מְנוּחָתִי:",
                "subsections": [
                    {
                        "id": 10,
                        "name": "לכו נרננה"
                    },
                    {
                        "id": 20,
                        "name": "ארבעים שנה"
                    }
                ]
            },
            {
                "name": "שירו לה'",
                "ref": "מזמור צ\"ו",
                "text": "שִׁירוּ לַה' שִׁיר חָדָשׁ שִׁירוּ לַה' כָּל הָאָרֶץ: שִׁירוּ לַה' בָּרֲכוּ שְׁמוֹ בַּשְּׂרוּ מִיּוֹם לְיוֹם יְשׁוּעָתוֹ: סַפְּרוּ בַגּוֹיִם כְּבוֹדוֹ בְּכָל הָעַמִּים נִפְלְאוֹתָיו: כִּי גָדוֹל ה' וּמְהֻלָּל מְאֹד נוֹרָא הוּא עַל כָּל אֱלֹהִים: כִּי כָּל אֱלֹהֵי הָעַמִּים אֱלִילִים וַה' שָׁמַיִם עָשָׂה: הוֹד וְהָדָר לְפָנָיו עֹז וְתִפְאֶרֶת בְּמִקְדָּשׁוֹ: הָבוּ לַה' מִשְׁפְּחוֹת עַמִּים הָבוּ לַה' כָּבוֹד וָעֹז: הָבוּ לַה' כְּבוֹד שְׁמוֹ שְׂאוּ מִנְחָה וּבֹאוּ לְחַצְרוֹתָיו: הִשְׁתַּחֲווּ לַה' בְּהַדְרַת קֹדֶשׁ חִילוּ מִפָּנָיו כָּל הָאָרֶץ: אִמְרוּ בַגּוֹיִם ה' מָלָךְ אַף תִּכּוֹן תֵּבֵל בַּל תִּמּוֹט יָדִין עַמִּים בְּמֵישָׁרִים: יִשְׂמְחוּ הַשָּׁמַיִם וְתָגֵל הָאָרֶץ יִרְעַם הַיָּם וּמְלֹאוֹ: יַעֲלֹז שָׂדַי וְכָל אֲשֶׁר בּוֹ אָז יְרַנְּנוּ כָּל עֲצֵי יָעַר: לִפְנֵי ה' כִּי בָא כִּי בָא לִשְׁפֹּט הָאָרֶץ יִשְׁפֹּט תֵּבֵל בְּצֶדֶק וְעַמִּים בֶּאֱמוּנָתוֹ:",
                "subsections": [
                    {
                        "id": 30,
                        "name": "שירו לה' שיר חדש"
                    },
                    {
                        "id": 40,
                        "name": "ישמחו השמים ותגל הארץ"
                    }
                ]
            },
            {
                "name": "ה' מלך תגל הארץ",
                "ref": "מזמור צ\"ז",
                "text": "ה' מָלָךְ תָּגֵל הָאָרֶץ יִשְׂמְחוּ אִיִּים רַבִּים: עָנָן וַעֲרָפֶל סְבִיבָיו צֶדֶק וּמִשְׁפָּט מְכוֹן כִּסְאוֹ: אֵשׁ לְפָנָיו תֵּלֵךְ וּתְלַהֵט סָבִיב צָרָיו: הֵאִירוּ בְרָקָיו תֵּבֵל רָאֲתָה וַתָּחֵל הָאָרֶץ: הָרִים כַּדּוֹנַג נָמַסּוּ מִלִּפְנֵי ה' מִלִּפְנֵי אֲדוֹן כָּל הָאָרֶץ: הִגִּידוּ הַשָּׁמַיִם צִדְקוֹ וְרָאוּ כָל הָעַמִּים כְּבוֹדוֹ: יֵבֹשׁוּ כָּל עֹבְדֵי פֶסֶל הַמִּתְהַלְלִים בָּאֱלִילִים הִשְׁתַּחֲווּ לוֹ כָּל אֱלֹהִים: שָׁמְעָה וַתִּשְׂמַח צִיּוֹן וַתָּגֵלְנָה בְּנוֹת יְהוּדָה לְמַעַן מִשְׁפָּטֶיךָ ה': כִּי אַתָּה ה' עֶלְיוֹן עַל כָּל הָאָרֶץ מְאֹד נַעֲלֵיתָ עַל כָּל אֱלֹהִים: אֹהֲבֵי ה' שִׂנְאוּ רָע שֹׁמֵר נַפְשׁוֹת חֲסִידָיו מִיַּד רְשָׁעִים יַצִּילֵם: אוֹר זָרֻעַ לַצַּדִּיק וּלְיִשְׁרֵי לֵב שִׂמְחָה: שִׂמְחוּ צַדִּיקִים בַּה' וְהוֹדוּ לְזֵכֶר קָדְשׁוֹ:",
                "subsections": [
                    {
                        "id": 50,
                        "name": "שמעה ותשמח ציון"
                    },
                    {
                        "id": 60,
                        "name": "כי אתה ה' עליון"
                    }
                ]
            },
            {
                "name": "מזמור שירו לה' שיר חדש",
                "ref": "מזמור צ\"ח",
                "text": "מִזְמוֹר שִׁירוּ לַה' שִׁיר חָדָשׁ כִּי נִפְלָאוֹת עָשָׂה הוֹשִׁיעָה לוֹ יְמִינוֹ וּזְרוֹעַ קָדְשׁוֹ: הוֹדִיעַ ה' יְשׁוּעָתוֹ לְעֵינֵי הַגּוֹיִם גִּלָּה צִדְקָתוֹ: זָכַר חַסְדּוֹ וֶאֱמוּנָתוֹ לְבֵית יִשְׂרָאֵל רָאוּ כָל אַפְסֵי אָרֶץ אֵת יְשׁוּעַת אֱלֹהֵינוּ: הָרִיעוּ לַה' כָּל הָאָרֶץ פִּצְחוּ וְרַנְּנוּ וְזַמֵּרוּ: זַמְּרוּ לַה' בְּכִנּוֹר בְּכִנּוֹר וְקוֹל זִמְרָה: בַּחֲצֹצְרוֹת וְקוֹל שׁוֹפָר הָרִיעוּ לִפְנֵי הַמֶּלֶךְ ה': יִרְעַם הַיָּם וּמְלֹאוֹ תֵּבֵל וְיֹשְׁבֵי בָהּ: נְהָרוֹת יִמְחֲאוּ כָף יַחַד הָרִים יְרַנֵּנוּ: לִפְנֵי ה' כִּי בָא לִשְׁפֹּט הָאָרֶץ יִשְׁפֹּט תֵּבֵל בְּצֶדֶק וְעַמִּים בְּמֵישָׁרִים:",
                "subsections": [
                    {
                        "id": 70,
                        "name": "שירו לה' שיר חדש"
                    },
                    {
                        "id": 80,
                        "name": "בחצצרות וקול שופר"
                    }
                ]
            },
            {
                "name": "ה' מלך ירגזו עמים",
                "ref": "מזמור צ\"ט",
                "text": "ה' מָלָךְ יִרְגְּזוּ עַמִּים יֹשֵׁב כְּרוּבִים תָּנוּט הָאָרֶץ: ה' בְּצִיּוֹן גָּדוֹל וְרָם הוּא עַל כָּל הָעַמִּים: יוֹדוּ שִׁמְךָ גָּדוֹל וְנוֹרָא קָדוֹשׁ הוּא: וְעֹז מֶלֶךְ מִשְׁפָּט אָהֵב אַתָּה כּוֹנַנְתָּ מֵישָׁרִים מִשְׁפָּט וּצְדָקָה בְּיַעֲקֹב אַתָּה עָשִׂיתָ: רוֹמְמוּ ה' אֱלֹהֵינוּ וְהִשְׁתַּחֲווּ לַהֲדֹם רַגְלָיו קָדוֹשׁ הוּא: מֹשֶׁה וְאַהֲרֹן בְּכֹהֲנָיו וּשְׁמוּאֵל בְּקֹרְאֵי שְׁמוֹ קֹרִאים אֶל ה' וְהוּא יַעֲנֵם: בְּעַמּוּד עָנָן יְדַבֵּר אֲלֵיהֶם שָׁמְרוּ עֵדֹתָיו וְחֹק נָתַן לָמוֹ: ה' אֱלֹהֵינוּ אַתָּה עֲנִיתָם אֵל נֹשֵׂא הָיִיתָ לָהֶם וְנֹקֵם עַל עֲלִילוֹתָם: רוֹמְמוּ ה' אֱלֹהֵינוּ וְהִשְׁתַּחֲווּ לְהַר קָדְשׁוֹ כִּי קָדוֹשׁ ה' אֱלֹהֵינוּ:",
                "subsections": [
                    {
                        "id": 90,
                        "name": "משה ואהרון"
                    },
                    {
                        "id": 100,
                        "name": "בעמוד ענן"
                    }
                ]
            },
            {
                "name": "מזמור לדוד",
                "ref": "מזמור כ\"ט",
                "text": "מִזְמוֹר לְדָוִד הָבוּ לַה' בְּנֵי אֵלִים הָבוּ לַה' כָּבוֹד וָעֹז: הָבוּ לַה' כְּבוֹד שְׁמוֹ הִשְׁתַּחֲווּ לַה' בְּהַדְרַת קֹדֶשׁ: קוֹל ה' עַל הַמָּיִם אֵל הַכָּבוֹד הִרְעִים ה' עַל מַיִם רַבִּים: קוֹל ה' בַּכֹּחַ קוֹל ה' בֶּהָדָר: קוֹל ה' שֹׁבֵר אֲרָזִים וַיְשַׁבֵּר ה' אֶת אַרְזֵי הַלְּבָנוֹן: וַיַּרְקִידֵם כְּמוֹ עֵגֶל לְבָנוֹן וְשִׂרְיֹן כְּמוֹ בֶן רְאֵמִים: קוֹל ה' חֹצֵב לַהֲבוֹת אֵשׁ: קוֹל ה' יָחִיל מִדְבָּר יָחִיל ה' מִדְבַּר קָדֵשׁ: קוֹל ה' יְחוֹלֵל אַיָּלוֹת וַיֶּחֱשֹׂף יְעָרוֹת וּבְהֵיכָלוֹ כֻּלּוֹ אֹמֵר כָּבוֹד: ה' לַמַּבּוּל יָשָׁב וַיֵּשֶׁב ה' מֶלֶךְ לְעוֹלָם: ה' עֹז לְעַמּוֹ יִתֵּן ה' יְבָרֵךְ אֶת עַמּוֹ בַשָּׁלוֹם:",
                "subsections": [
                    {
                        "id": 110,
                        "name": "מזמור לדוד"
                    },
                    {
                        "id": 120,
                        "name": "קול ה' יחולל איילות"
                    }
                ]
            },
            {
                "name": "אנא בכח",
                "text": [
                    "אַנָּא בְּכֹחַ גְּדֻלַּת יְמִינְךָ תַּתִּיר צְרוּרָה: קַבֵּל רִנַּת עַמְּךָ שַׂגְּבֵנוּ טַהֲרֵנוּ נוֹרָא: נָא גִּבּוֹר דּוֹרְשֵׁי יִחוּדְךָ כְּבַבַּת שָׁמְרֵם: בָּרְכֶם טַהֲרֵם רַחֲמֵי צִדְקָתְךָ תָּמִיד גָּמְלֵם: חָסִין קָדוֹשׁ בְּרוֹב טוּבְךָ נָהֵל עֲדָתֵךָ: יָחִיד גֵּאֶה לְעַמְּךָ פְּנֵה זוֹכְרֵי קְדֻשֶּׁתֶּךָ: שַׁוְעָתֵנוּ קַבֵּל וְשָׁמַע צַעֲקָתֵנוּ יוֹדֵעַ תַּעֲלֻמוֹת:",
                    "בָּרוּךְ שֵׁם כְּבוֹד מַלְכוּתוֹ לְעוֹלָם וָעֶד:"
                ],
                "subsections": [
                    {
                        "id": 130,
                        "name": "אנא בכח"
                    }
                ]
            },
            {
                "name": "לכה דודי",
                "text": [
                    "לְכָה דוֹדִי לִקְרַאת כַּלָּה פְּנֵי שַׁבָּת נְקַבְּלָה:",
                    "שָׁמוֹר וְזָכוֹר בְּדִבּוּר אֶחָד הִשְׁמִיעָנוּ אֵל הַמְּיֻחָד ה' אֶחָד וּשְׁמוֹ אֶחָד לְשֵׁם וּלְתִפְאֶרֶת וְלִתְהִלָּה:",
                    "לִקְרַאת שַׁבָּת לְכוּ וְנֵלְכָה כִּי הִיא מְקוֹר הַבְּרָכָה מֵרֹאשׁ מִקֶּדֶם נְסוּכָה סוֹף מַעֲשֶׂה בְּמַחֲשָׁבָה תְּחִלָּה:",
                    "מִקְדַּשׁ מֶלֶךְ עִיר מְלוּכָה קוּמִי צְאִי מִתּוֹךְ הַהֲפֵכָה רַב לָךְ שֶׁבֶת בְּעֵמֶק הַבָּכָא וְהוּא יַחֲמוֹל עָלַיִךְ חֶמְלָה:",
                    "הִתְנַעֲרִי מֵעָפָר קוּמִי לִבְשִׁי בִּגְדֵי תִפְאַרְתֵּךְ עַמִּי עַל יַד בֶּן יִשַׁי בֵּית הַלַּחְמִי קָרְבָה אֶל נַפְשִׁי גְּאָלָהּ:",
                    "הִתְעוֹרְרִי הִתְעוֹרְרִי כִּי בָא אוֹרֵךְ קוּמִי אוֹרִי עוּרִי עוּרִי שִׁיר דַּבֵּרִי כְּבוֹד ה' עָלַיִךְ נִגְלָה:",
                    "לֹא תֵבֹשִׁי וְלֹא תִכָּלְמִי מַה תִּשְׁתּוֹחֲחִי וּמַה תֶּהֱמִי בָּךְ יֶחֱסוּ עֲנִיֵּי עַמִּי וְנִבְנְתָה עִיר עַל תִּלָּהּ:",
                    "וְהָיוּ לִמְשִׁסָּה שֹׁאסָיִךְ וְרָחֲקוּ כָּל מְבַלְּעָיִךְ יָשִׂישׂ עָלַיִךְ אֱלֹהָיִךְ כִּמְשׂוֹשׂ חָתָן עַל כַּלָּה:",
                    "יָמִין וּשְׂמֹאל תִּפְרֹצִי וְאֶת ה' תַּעֲרִיצִי עַל יַד אִישׁ בֶּן פַּרְצִי וְנִשְׂמְחָה וְנָגִילָה:",
                    "בֹּאִי בְשָׁלוֹם עֲטֶרֶת בַּעְלָהּ גַּם בְּשִׂמְחָה (בְּרִנָה) וּבְצָהֳלָה תּוֹךְ אֱמוּנֵי עַם סְגֻלָּה בּוֹאִי כַלָּה בּוֹאִי כַלָּה (תּוֹךְ אֱמוּנֵי עַם סְגֻלָּה בּוֹאִי כַלָּה שַׁבָּת מַלְכְּתָא):"
                ],
                "subsections": [
                    {
                        "id": 140,
                        "name": "לכה דודי"
                    },
                    {
                        "id": 150,
                        "name": "מקדש מלך"
                    },
                    {
                        "id": 160,
                        "name": "בואי בשלום"
                    }
                ]
            },
            {
                "name": "מזמור שיר ליום השבת",
                "ref": "מזמור צ\"ב",
                "text": "מִזְמור שיר לְיום הַשּבָּת: טוב לְהודות לה' וּלְזַמֵּר לְשמְךָ עֶלְיון: לְהַגִּיד בַּבּוקֶר חַסְדֶּךָ וֶאֱמוּנָתְךָ בַּלֵּילות: עֲלֵי עָשור וַעֲלֵי נָבֶל עֲלֵי הִגָּיון בְּכִנּור: כִּי שמַּחְתַּנִי ה' בְּפָעֳלֶךָ בְּמַעֲשי יָדֶיךָ אֲרַנֵּן: מַה גָּדְלוּ מַעֲשיךָ ה' מְאד עָמְקוּ מַחְשבתֶיךָ: אִיש בַּעַר לא יֵדָע וּכְסִיל לא יָבִין אֶת זאת: בִּפְרחַ רְשעִים כְּמו עֵשב וַיָּצִיצוּ כָּל פּעֲלֵי אָוֶן לְהִשּמְדָם עֲדֵי עַד: וְאַתָּה מָרום לְעולָם ה': כִּי הִנֵּה איְבֶיךָ ה' כִּי הִנֵּה איְבֶיךָ יאבֵדוּ יִתְפָּרְדוּ כָּל פּעֲלֵי אָוֶן: וַתָּרֶם כִּרְאֵים קַרְנִי בַּלּתִי בְּשמֶן רַעֲנָן וַתַּבֵּט עֵינִי בְּשוּרָי בַּקָּמִים עָלַי מְרֵעִים תִּשמַעְנָה אָזְנָי: צַדִּיק כַּתָּמָר יִפְרָח כְּאֶרֶז בַּלְּבָנון יִשגֶּה: שתוּלִים בְּבֵית ה' בְּחַצְרות אֱלהֵינוּ יַפְרִיחוּ: עוד יְנוּבוּן בְּשיבָה דְּשנִים וְרַעֲנַנִּים יִהְיוּ: לְהַגִּיד כִּי יָשר ה' צוּרִי וְלא עַוְלָתָה בּו:",
                "subsections": [
                    {
                        "id": 170,
                        "name": "מזמור שיר"
                    },
                    {
                        "id": 180,
                        "name": "צדיק כתמר"
                    }
                ]
            },
            {
                "name": "ה' מלך גאות לבש",
                "ref": "מזמור צ\"ג",
                "text": "ה' מָלָךְ גֵּאוּת לָבֵש לָבֵש ה' עז הִתְאַזָּר אַף תִּכּון תֵּבֵל בַּל תִּמּוט: נָכון כִּסְאֲךָ מֵאָז מֵעולָם אָתָּה: נָשאוּ נְהָרות ה' נָשאוּ נְהָרות קולָם יִשאוּ נְהָרות דָּכְיָם: מִקּלות מַיִם רַבִּים אַדִּירִים מִשבְּרֵי יָם אַדִּיר בַּמָּרום ה': עֵדתֶיךָ נֶאֱמְנוּ מְאד לְבֵיתְךָ נָאֲוָה קּדֶש ה' לְארֶךְ יָמִים:",
                "subsections": [
                    {
                        "id": 190,
                        "name": "ה' מלך"
                    },
                    {
                        "id": 200,
                        "name": "מקלות מים רבים"
                    }
                ]
            }
        ]
    },
    {
        "key": "hallel",
        "sections": [
            {
                "name": "ברכת ההלל",
                "text": "בָּרוּךְ אַתָּה ה' אֱלהֵינוּ מֶלֶךְ הָעולָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְותָיו וְצִוָּנוּ לִקְרא אֶת הַהַלֵּל:",
                "subsections": [
                    {
                        "id": 210,
                        "name": "ברוך אתה"
                    }
                ]
            },
            {
                "name": "הללויה הללו עבדי ה'",
                "ref": "מזמור קי\"ג",
                "text": "הַלְלוּיָהּ הַלְלוּ עַבְדֵי ה' הַלְלוּ אֶת שֵׁם ה': יְהִי שֵׁם ה' מְבורָךְ מֵעַתָּה וְעַד עולָם: מִמִּזְרַח שֶׁמֶשׁ עַד מְבואו מְהֻלָּל שֵׁם ה': רָם עַל כָּל גּויִם ה' עַל הַשָּׁמַיִם כְּבודו: מִי כה' אֱלהֵינוּ הַמַּגְבִּיהִי לָשָׁבֶת: הַמַּשְׁפִּילִי לִרְאות בַּשָּׁמַיִם וּבָאָרֶץ: מְקִימִי מֵעָפָר דָּל מֵאַשְׁפּת יָרִים אֶבְיון: לְהושִׁיבִי עִם נְדִיבִים עִם נְדִיבֵי עַמּו: מושִׁיבִי עֲקֶרֶת הַבַּיִת אֵם הַבָּנִים שמֵחָה הַלְלוּיָהּ:",
                "subsections": [
                    {
                        "id": 220,
                        "name": "הללו עבדי ה'"
                    },
                    {
                        "id": 230,
                        "name": "מי כה' אלקינו"
                    }
                ]
            },
            {
                "name": "בצאת ישראל ממצרים",
                "ref": "מזמור קי\"ד",
                "text": "בְּצֵאת יִשרָאֵל מִמִּצְרָיִם בֵּית יַעֲקב מֵעַם לועֵז: הָיְתָה יְהוּדָה לְקָדְשׁו יִשרָאֵל מַמְשְׁלותָיו: הַיָּם רָאָה וַיָּנס הַיַּרְדֵּן יִסּב לְאָחור: הֶהָרִים רָקְדוּ כְאֵילִים גְּבָעות כִּבְנֵי צאן: מַה לְּךָ הַיָּם כִּי תָנוּס הַיַּרְדֵּן תִּסּב לְאָחור: הֶהָרִים תִּרְקְדוּ כְאֵילִים גְּבָעות כִּבְנֵי צאן: מִלִּפְנֵי אָדון חוּלִי אָרֶץ מִלִּפְנֵי אֱלוהַּ יַעֲקב: הַהפְכִי הַצוּר אֲגַם מָיִם חַלָּמִישׁ לְמַעְיְנו מָיִם:",
                "subsections": [
                    {
                        "id": 250,
                        "name": "בצאת ישראל"
                    }
                ]
            },
            {
                "name": "לא לנו ה'",
                "ref": "מזמור קט\"ו",
                "text": "לא לָנוּ ה' לא לָנוּ כִּי לְשִׁמְךָ תֵּן כָּבוד עַל חַסְדְּךָ עַל אֲמִתֶּךָ: לָמָּה יאמְרוּ הַגּויִם אַיֵה נָא אֱלהֵיהֶם: וֵאלהֵינוּ בַשָּׁמָיִם כּל אֲשֶׁר חָפֵץ עָשה: עֲצַבֵּיהֶם כֶּסֶף וְזָהָב מַעֲשה יְדֵי אָדָם: פֶּה לָהֶם וְלא יְדַבֵּרוּ עֵינַיִם לָהֶם וְלא יִרְאוּ: אָזְנַיִם לָהֶם וְלא יִשְׁמָעוּ אַף לָהֶם וְלא יְרִיחוּן: יְדֵיהֶם וְלא יְמִישׁוּן רַגְלֵיהֶם וְלא יְהַלֵּכוּ לא יֶהְגּוּ בִּגְרונָם: כְּמוהֶם יִהְיוּ עשיהֶם כּל אֲשֶׁר בּטֵחַ בָּהֶם: יִשרָאֵל בְּטַח בה' עֶזְרָם וּמָגִנָּם הוּא: בֵּית אַהֲרן בִּטְחוּ בה' עֶזְרָם וּמָגִנָּם הוּא: יִרְאֵי ה' בִּטְחוּ בה' עֶזְרָם וּמָגִנָּם הוּא:",
                "subsections": [
                    {
                        "id": 260,
                        "name": "ישראל בטח בה'"
                    }
                ]
            },
            {
                "name": "ה' זכרנו יברך",
                "ref": "מזמור קט\"ו",
                "text": "ה' זְכָרָנוּ יְבָרֵךְ יְבָרֵךְ אֶת בֵּית יִשרָאֵל יְבָרֵךְ אֶת בֵּית אַהֲרן: יְבָרֵךְ יִרְאֵי ה' הַקְּטַנִּים עִם הַגְּדלִים: יסֵף ה' עֲלֵיכֶם עֲלֵיכֶם וְעַל בְּנֵיכֶם: בְּרוּכִים אַתֶּם לה' עשה שָׁמַיִם וָאָרֶץ: הַשָּׁמַיִם שָׁמַיִם לה' וְהָאָרֶץ נָתַן לִבְנֵי אָדָם: לא הַמֵּתִים יְהַלְלוּ יָהּ וְלא כָּל יורְדֵי דוּמָה: וַאֲנַחְנוּ נְבָרֵךְ יָהּ מֵעַתָּה וְעַד עולָם הַלְלוּיָהּ:",
                "subsections": [
                    {
                        "id": 270,
                        "name": "יברך את בית ישראל"
                    }
                ]
            },
            {
                "name": "אהבתי כי ישמע ה'",
                "ref": "מזמור קט\"ז",
                "text": "אָהַבְתִּי כִּי יִשְׁמַע ה' אֶת קולִי תַּחֲנוּנָי: כִּי הִטָּה אָזְנו לִי וּבְיָמַי אֶקְרָא: אֲפָפוּנִי חֶבְלֵי מָוֶת וּמְצָרֵי שְׁאול מְצָאוּנִי צָרָה וְיָגון אֶמְצָא: וּבְשֵׁם ה' אֶקְרָא אָנָּה ה' מַלְּטָה נַפְשִׁי: חַנּוּן ה' וְצַדִּיק וֵאלהֵינוּ מְרַחֵם: שׁמֵר פְּתָאיִם ה' דַּלּותִי וְלִי יְהושִׁיעַ: שׁוּבִי נַפְשִׁי לִמְנוּחָיְכִי כִּי ה' גָּמַל עָלָיְכִי: כִּי חִלַּצְתָּ נַפְשִׁי מִמָּוֶת אֶת עֵינִי מִן דִּמְעָה אֶת רַגְלִי מִדֶּחִי: אֶתְהַלֵךְ לִפְנֵי ה' בְּאַרְצות הַחַיִּים: הֶאֱמַנְתִּי כִּי אֲדַבֵּר אֲנִי עָנִיתִי מְאד: אֲנִי אָמַרְתִּי בְחָפְזִי כָּל הָאָדָם כּזֵב:",
                "subsections": [
                    {
                        "id": 280,
                        "name": "שובי נפשי"
                    }
                ]
            },
            {
                "name": "מה אשיב לה'",
                "ref": "מזמור קט\"ז",
                "text": "מָה אָשִׁיב לה' כָּל תַּגְמוּלוהִי עָלָי: כּוס יְשׁוּעות אֶשּא וּבְשֵׁם ה' אֶקְרָא: נְדָרַי לה' אֲשַׁלֵם נֶגְדָּה נָּא לְכָל עַמּו: יָקָר בְּעֵינֵי ה' הַמָּוְתָה לַחֲסִידָיו: אָנָּה ה' כִּי אֲנִי עַבְדֶּךָ אֲנִי עַבְדְּךָ בֶּן אֲמָתֶךָ פִּתַּחְתָּ לְמוסֵרָי: לְךָ אֶזְבַּח זֶבַח תּודָה וּבְשֵׁם ה' אֶקְרָא: נְדָרַי לה' אֲשַׁלֵּם נֶגְּדָּה נָּא לְכָל עַמּו: בְּחַצְרות בֵּית ה' בְּתוכֵכִי יְרוּשָׁלָיִם הַלְלוּיָהּ:",
                "subsections": [
                    {
                        "id": 290,
                        "name": "מה אשיב לה'"
                    }
                ]
            },
            {
                "name": "הללו את ה' כל גויים",
                "ref": "מזמור קי\"ז - קי\"ח",
                "text": [
                    "הַלְלוּ אֶת ה' כָּל גּויִם שַׁבְּחוּהוּ כָּל הָאֻמִּים: כִּי גָבַר עָלֵינוּ חַסְדּו וֶאֱמֶת ה' לְעולָם הַלְלוּיָהּ:",
                    "הודוּ לה' כִּי טוב כִּי לְעולָם חַסְדּו:",
                    "יאמַר נָא יִשרָאֵל כִּי לְעולָם חַסְדּו:",
                    "יאמְרוּ נָא בֵּית אַהֲרן כִּי לְעולָם חַסְדּו:",
                    "יאמְרוּ נָא יִרְאֵי ה' כִּי לְעולָם חַסְדּו:"
                ],
                "subsections": [
                    {
                        "id": 300,
                        "name": "הללו את ה'"
                    }
                ]
            },
            {
                "name": "מן המצר",
                "ref": "מזמור קי\"ח",
                "text": [
                    "מִן הַמֵּצַר קָרָאתִי יָהּ עָנָנִי בַּמֶּרְחַב יָהּ: ה' לִי לא אִירָא מַה יַעֲשה לִי אָדָם: ה' לִי בְּעוזְרָי וַאֲנִי אֶרְאֶה בְשנְאָי: טוב לַחֲסות בה' מִבְּטחַ בָּאָדָם: טוב לַחֲסות בה' מִבְּטחַ בִּנְדִיבִים: כָּל גּויִם סְבָבוּנִי בְּשֵׁם ה' כִּי אֲמִילַם: סַבּוּנִי גַם סְבָבוּנִי בְּשֵׁם ה' כִּי אֲמִילַם: סַבּוּנִי כִדְבורִים דּעֲכוּ כְּאֵשׁ קוצִים בְּשֵׁם ה' כִּי אֲמִילַם: דָּחה דְחִיתַנִי לִנְפּל וה' עֲזָרָנִי: עָזִּי וְזִמְרָת יָהּ וַיְהִי לִי לִישׁוּעָה: קול רִנָּה וִישׁוּעָה בְּאָהֳלֵי צַדִּיקִים יְמִין ה' עשה חָיִל: יְמִין ה' רומֵמָה יְמִין ה' עשה חָיִל: לא אָמוּת כִּי אֶחְיֶה וַאֲסַפֵּר מַעֲשי יָהּ: יַסּור יִסְּרַנִּי יָהּ וְלַמָּוֶת לא נְתָנָנִי: פִּתְחוּ לִי שַׁעֲרֵי צֶדֶק אָבא בָם אודֶה יָהּ: זֶה הַשַּׁעַר לה' צַדִּיקִים יָבאוּ בו:",
                    "אודְךָ כִּי עֲנִיתָנִי וַתְּהִי לִי לִישׁוּעָה:",
                    "אֶבֶן מָאֲסוּ הַבּונִים הָיְתָה לְראשׁ פִּנָּה:",
                    "מֵאֵת ה' הָיְתָה זאת הִיא נִפְלָאת בְּעֵינֵינוּ:",
                    "זֶה הַיּום עָשה ה' נָגִילָה וְנִשמְחָה בו:"
                ],
                "subsections": [
                    {
                        "id": 310,
                        "name": "מן המצר"
                    },
                    {
                        "id": 320,
                        "name": "קול רנה וישועה"
                    },
                    {
                        "id": 330,
                        "name": "לא אמות + אודך"
                    }
                ]
            },
            {
                "name": "אנא ה'",
                "ref": "מזמור קי\"ח",
                "text": [
                    "אָנָּא ה' הושִׁיעָה נָּא: אָנָּא ה' הושִׁיעָה נָּא:",
                    "אָנָּא ה' הַצְלִיחָה נָּא: אָנָּא ה' הַצְלִיחָה נָּא:"
                ],
                "subsections": [
                    {
                        "id": 340,
                        "name": "אנא ה'"
                    }
                ]
            },
            {
                "name": "ברוך הבא בשם ה'",
                "ref": "מזמור קי\"ח",
                "text": "בָּרוּךְ הַבָּא בְּשֵׁם ה' בֵּרַכְנוּכֶם מִבֵּית ה': אֵל ה' וַיָּאֶר לָנוּ אִסְרוּ חַג בַּעֲבותִים עַד קַרְנות הַמִּזְבֵּחַ: אֵלִי אַתָּה וְאודֶךָּ אֱלהַי אֲרומְמֶךָּ: הודוּ לה' כִּי טוב כִּי לְעולָם חַסְדּו:",
                "subsections": [
                    {
                        "id": 350,
                        "name": "ברוך הבא + אלי אתה"
                    }
                ]
            },
            {
                "name": "יהללוך ה'",
                "ref": "מזמור קי\"ח",
                "text": "יְהַלְלוּךָ ה' אֱלהֵינוּ עַל כָּל מַעֲשיךָ וַחֲסִידֶיךָ צַדִּיקִים עושי רְצונֶךָ וְכָל עַמְּךָ בֵּית יִשרָאֵל בְּרִנָּה יודוּ וִיבָרְכוּ וִישַׁבְּחוּ וִיפָאֲרוּ וִישׁורְרוּ וִירומְמוּ וְיַעֲרִיצוּ וְיַקְדִּישׁוּ וְיַמְלִיכוּ אֶת שִׁמְךָ מַלְכֵּנוּ תָּמִיד כִּי לְךָ טוב לְהודות וּלְשִׁמְךָ נָּאֶה לְזַמֵּר כִּי מֵעולָם וְעַד עולָם אַתָּה אֵל: בָּרוּךְ אַתָּה ה' מֶלֶךְ מְהֻלָּל בַּתִּשְׁבָּחות:",
                "subsections": [
                    {
                        "id": 360,
                        "name": "יהללוך ה'"
                    }
                ]
            }
        ]
    }
]
