{
    "texts": {
        "kabbalat_shabbat": {
            "id": 123,
            "name": "קבלת שבת",
            "sections": [
                {
                    "name": "לְכוּ נְרַנְּנָה",
                    "id": "Psalm.95",
                    "text": [
                        "לְכוּ נְרַנְּנָה לַיהוָה נָרִיעָה לְצוּר יִשְׁעֵנוּ:",
                        "נְקַדְּמָה פָנָיו בְּתוֹדָה בִּזְמִרוֹת נָרִיעַ לוֹ:",
                        "כִּי אֵל גָּדוֹל יְהוָה וּמֶלֶךְ גָּדוֹל עַל כָּל אֱלֹהִים:",
                        "אֲשֶׁר בְּיָדוֹ מֶחְקְרֵי אָרֶץ וְתוֹעֲפוֹת הָרִים לוֹ:",
                        "אֲשֶׁר לוֹ הַיָּם וְהוּא עָשָׂהוּ וְיַבֶּשֶׁת יָדָיו יָצָרוּ:",
                        "בֹּאוּ נִשְׁתַּחֲוֶה וְנִכְרָעָה נִבְרְכָה לִפְנֵי יְהוָה עֹשֵׂנוּ:",
                        "כִּי הוּא אֱלֹהֵינוּ וַאֲנַחְנוּ עַם מַרְעִיתוֹ וְצֹאן יָדוֹ הַיּוֹם אִם בְּקֹלוֹ תִשְׁמָעוּ:",
                        "אַל תַּקְשׁוּ לְבַבְכֶם כִּמְרִיבָה כְּיוֹם מַסָּה בַּמִּדְבָּר:",
                        "אֲשֶׁר נִסּוּנִי אֲבוֹתֵיכֶם בְּחָנוּנִי גַּם רָאוּ פָעֳלִי:",
                        "אַרְבָּעִים שָׁנָה אָקוּט בְּדוֹר וָאֹמַר עַם תֹּעֵי לֵבָב הֵם וְהֵם לֹא יָדְעוּ דְרָכָי:",
                        "אֲשֶׁר נִשְׁבַּעְתִּי בְאַפִּי אִם יְבֹאוּן אֶל מְנוּחָתִי:"
                    ]
                },
                {
                    "name": "שִׁירוּ לַה' שִׁיר חָדָשׁ",
                    "id": "Psalm.96",
                    "text": [
                        "שִׁירוּ לַה' שִׁיר חָדָשׁ שִׁירוּ לַה' כָּל הָאָרֶץ:",
                        "שִׁירוּ לַה' בָּרֲכוּ שְׁמוֹ בַּשְּׂרוּ מִיּוֹם לְיוֹם יְשׁוּעָתוֹ:",
                        "סַפְּרוּ בַגּוֹיִם כְּבוֹדוֹ בְּכָל הָעַמִּים נִפְלְאוֹתָיו:",
                        "כִּי גָדוֹל ה' וּמְהֻלָּל מְאֹד נוֹרָא הוּא עַל כָּל אֱלֹהִים:",
                        "כִּי כָּל אֱלֹהֵי הָעַמִּים אֱלִילִים וַה' שָׁמַיִם עָשָׂה:",
                        "הוֹד וְהָדָר לְפָנָיו עֹז וְתִפְאֶרֶת בְּמִקְדָּשׁוֹ:",
                        "הָבוּ לַה' מִשְׁפְּחוֹת עַמִּים הָבוּ לַה' כָּבוֹד וָעֹז:",
                        "הָבוּ לַה' כְּבוֹד שְׁמוֹ שְׂאוּ מִנְחָה וּבֹאוּ לְחַצְרוֹתָיו:",
                        "הִשְׁתַּחֲווּ לַה' בְּהַדְרַת קֹדֶשׁ חִילוּ מִפָּנָיו כָּל הָאָרֶץ:",
                        "אִמְרוּ בַגּוֹיִם ה' מָלָךְ אַף תִּכּוֹן תֵּבֵל בַּל תִּמּוֹט יָדִין עַמִּים בְּמֵישָׁרִים:",
                        "יִשְׂמְחוּ הַשָּׁמַיִם וְתָגֵל הָאָרֶץ יִרְעַם הַיָּם וּמְלֹאוֹ:",
                        "יַעֲלֹז שָׂדַי וְכָל אֲשֶׁר בּוֹ אָז יְרַנְּנוּ כָּל עֲצֵי יָעַר:",
                        "לִפְנֵי ה' כִּי בָא כִּי בָא לִשְׁפֹּט הָאָרֶץ יִשְׁפֹּט תֵּבֵל בְּצֶדֶק וְעַמִּים בֶּאֱמוּנָתוֹ:"
                    ]
                }
            ]
        }
    },
    "playlists": {
        "lekha_dodi": {
            "id": 123,
            "name": "לכה דודי",
            "tunes": {
                "1": {
                    "name": "דויד מלך ישראל",
                    "link": "https://youtu.be/lBfa7fGPpxQ"
                },
                "2": {
                    "name": "שומרים הפקד לעירך",
                    "link": "https://youtu.be/CIAWk9Im_DA"
                },
                "3": {
                    "name": "יפרח בימיו צדיק / ואני נתתי לך",
                    "link": "https://www.youtube.com/watch?v=x9m6SxTWTbQ"
                }
            }
        },
        "Psalm.92": {
            "id": 456,
            "name": "מזמור שיר ליום השבת",
            "tunes": {
                "4": {
                    "name": "הרחמן הוא יקים",
                    "startAt": "13,צדיק כתמר יפרח",
                    "link": "https://youtu.be/j_OKvIc4hJ8"
                }
            }
        }
    },
    "categories": {
        "kabbalat_shabbat": {
            "name": "קבלת שבת",
            "ancestors": ["shabbat", "shabbat-eve"],
            "isFinal": true
        }
    }
}
