import { Box, Typography } from "@mui/material";
import useText from "../hooks/text";

export default function Text({ id, ...props }) {
    const { isLoading, text, error } = useText(id);
    if (error) {
        console.error(error);
    } else if (isLoading) {
        return <Typography>loading...</Typography>;
    } else {
        return (
            <Box {...props}>
                <Typography sx={{ fontSize: "1.5rem", mx: 3 }}>
                    לְכָה דוֹדִי לִקְרַאת כַּלָּה פְּנֵי שַׁבָּת נְקַבְּלָה
                    <br />
                    <br />
                    שָׁמוֹר וְזָכוֹר בְּדִבּוּר אֶחָד הִשְׁמִיעָנוּ אֵל
                    הַמְּיֻחָד
                    <br />
                    ה' אֶחָד וּשְׁמוֹ אֶחָד לְשֵׁם וּלְתִפְאֶרֶת וְלִתְהִלָּה
                    <br />
                    <br />
                    לִקְרַאת שַׁבָּת לְכוּ וְנֵלְכָה כִּי הִיא מְקוֹר הַבְּרָכָה
                    <br />
                    מֵרֹאשׁ מִקֶּדֶם נְסוּכָה סוֹף מַעֲשֶׂה בְּמַחֲשָׁבָה
                    תְּחִלָּה
                    <br />
                    <br />
                    מִקְדַּשׁ מֶלֶךְ עִיר מְלוּכָה קוּמִי צְאִי מִתּוֹךְ
                    הַהֲפֵכָה
                    <br />
                    רַב לָךְ שֶׁבֶת בְּעֵמֶק הַבָּכָא וְהוּא יַחֲמוֹל עָלַיִךְ
                    חֶמְלָה
                    <br />
                    <br />
                    הִתְנַעֲרִי מֵעָפָר קוּמִי לִבְשִׁי בִּגְדֵי תִפְאַרְתֵּךְ
                    עַמִּי
                    <br />
                    עַל יַד בֶּן יִשַׁי בֵּית הַלַּחְמִי קָרְבָה אֶל נַפְשִׁי
                    גְּאָלָהּ
                    <br />
                    <br />
                    הִתְעוֹרְרִי הִתְעוֹרְרִי כִּי בָא אוֹרֵךְ קוּמִי אוֹרִי
                    <br />
                    עוּרִי עוּרִי שִׁיר דַּבֵּרִי כְּבוֹד ה' עָלַיִךְ נִגְלָה
                    <br />
                    <br />
                    לֹא תֵבֹשִׁי וְלֹא תִכָּלְמִי מַה תִּשְׁתּוֹחֲחִי וּמַה
                    תֶּהֱמִי
                    <br />
                    בָּךְ יֶחֱסוּ עֲנִיֵּי עַמִּי וְנִבְנְתָה עִיר עַל תִּלָּהּ
                    <br />
                    <br />
                    וְהָיוּ לִמְשִׁסָּה שֹׁאסָיִךְ וְרָחֲקוּ כָּל מְבַלְּעָיִךְ
                    <br />
                    יָשִׂישׂ עָלַיִךְ אֱלֹהָיִךְ כִּמְשׂוֹשׂ חָתָן עַל כַּלָּה
                    <br />
                    <br />
                    יָמִין וּשְׂמֹאל תִּפְרֹצִי וְאֶת ה' תַּעֲרִיצִי
                    <br />
                    עַל יַד אִישׁ בֶּן פַּרְצִי וְנִשְׂמְחָה וְנָגִילָה
                    <br />
                    <br />
                    בֹּאִי בְשָׁלוֹם עֲטֶרֶת בַּעְלָהּ גַּם בְּשִׂמְחָה
                    (בְּרִנָה) וּבְצָהֳלָה
                    <br />
                    תּוֹךְ אֱמוּנֵי עַם סְגֻלָּה בּוֹאִי כַלָּה בּוֹאִי כַלָּה
                    <br />
                    (תּוֹךְ אֱמוּנֵי עַם סְגֻלָּה בּוֹאִי כַלָּה שַׁבָּת
                    מַלְכְּתָא)
                </Typography>
            </Box>
        );
    }
}
